# ♨ IVF-M HP pH 측정 간소화를 통한 공정시간 단축 및 GMP 리스크 감소

# ☎ 배치별 히스토리 ----

# 데이터 불러오기

batch = c('HMG19001', 'HMG19002', 'HMG19003', 'HMG19004', 'HMG19005', 'HMG19006', 'HMG19007', 'HMG19008', 'HMG19009', 'HMG19010', 'HMG19011', 'HMG19012', 'HMG19013', 'HMG20001', 'HMG20002', 'HMG20003', 'HMG20004', 'HMG20005', 'HMG20006', 'HMG20007', 'HMG20008', 'HMG20009', 'HMG20010', 'HMG20011', 'HMG20012', 'HMG20013', 'HMG20014', 'HMG20015')

before = c(4.56, 4.68, 4.58, 4.62, 4.7, 4.79, 4.76, 5.16, 5.06, 5.11, 5.17, 5.07, 4.83, 4.84, 4.9, 5.04, 5.24, 5.5, 5.5, 5.2, 4.72, 5.04, 4.92, 4.7, 5, 4.74, 4.85, 5.02)

after = c(6.42, 6.43, 6.42, 6.43, 6.39, 6.45, 6.4, 6.36, 6.49, 6.44, 6.4, 6.36, 6.41, 6.43, 6.41, 6.4, 6.42, 6.36, 6.44, 6.39, 6.39, 6.42, 6.42, 6.4, 6.39, 6.37, 6.41, 6.35)

df = data.frame(batch, before, after)
head(df, 3)

df_raw <- df

# Q1. ----
# 최근 3년간 IVF-M HP주 75IU 의 적정 전 버퍼 pH 분포의 박스 그래프를 확인하시오.





# Q2. ----
# 최근 3년간 IVF-M HP주 75IU 의 적정 전 버퍼 pH 분포의 Q1 ~ Q5 의 값을 확인하시오.






# install.packages("SixSigma")

library(SixSigma)

# Q3. ----
# pH 적정 전/후 공정 수준을 비교하시오.







# Q4. ----
# 적정 전/후의 관리도를 확인하시오.

# install.packages("qcc")

library(qcc)




# ☎ NaOH 투입에 따른 pH 적정 ----

# 데이터 불러오기

NaOH = c(0:9)
HMG21002 = c(4.8, 4.72, 4.93, 5.19, 5.44, 5.71, 5.85, 6.11, 6.31, 6.46)
HMG21003 = c(4.83, 4.75, 4.86, 5.02, 5.13, 5.51, 5.62, 6.01, 6.12, 6.32)
HMG21004 = c(4.82, 4.74, 4.9, 5.11, 5.29, 5.61, 5.74, 6.06, 6.22, 6.39)

tilt = data.frame(NaOH, HMG21002, HMG21003, HMG21004)
head(tilt, 3)


# Q5. ----
# HMG21002~4 각 배치별 NaOH 투입에 따른 pH 변화량 그래프를 그리시오.


# install.packages("tidyverse")
# install.packages("ggplot2")

library(tidyverse)
library(dplyr)
library(ggplot2)
